Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp

#include <tinyhal.h>
#include <Samraksh\Message.h>
#include <Samraksh\Radio.h>
#include <string.h>

#include "si446x.h"

// Hardware stuff
#include <stm32f10x.h>

#define ASSERT_RADIO(x)  if(!(x)){ SOFT_BREAKPOINT(); }

// Automatically moves the radio to RX after a transmit instead of sleeping.
// Comment out below line to disable and use default ('0')
#define SI446x_TX_DONE_STATE (SI_STATE_RX<<4)
// Default value for above, radio returns to previous state.
#ifndef SI446x_TX_DONE_STATE
#define SI446x_TX_DONE_STATE (SI_STATE_SPI_ACTIVE<<4)
#endif

// Do NOT to back to RX after sending an ACK.
#define SI446x_TX_ACK_DONE_STATE (SI_STATE_SPI_ACTIVE<<4)

//#define SI446x_INT_MODE_CHECK_DO
// comment out above to disable check
#ifdef SI446x_INT_MODE_CHECK_DO
#define SI446x_INT_MODE_CHECK() \
	if (((SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0)) { \
		si446x_debug_print(ERR99, "SI446X: %s() WARNING, CALLED IN INTERRUPT!\r\n", __func__); \
	}
#else
#define SI446x_INT_MODE_CHECK() {}
#endif


#define SI446X_DEBUG_UNFINISHED_PKT // remove me.
#ifdef SI446X_DEBUG_UNFINISHED_PKT
static volatile bool int_defer = false;
static volatile bool finisher_queued = false;
#endif

enum { SI_DUMMY=0, };

// For now, memorize all WWF serial numbers
// Yes these are strings and yes I'm a terrible person.
// These are hex CPU serial numbers
enum { serial_max = 2, serial_per = 25 };
//const char wwf_serial_numbers[serial_max][serial_per]  = { "3300d9054642353044501643", "3300e0054642353045241643" };
const char dotnow_serial_numbers[serial_max][serial_per] = { "392dd9054355353848400843", "3400d805414d303635341043" };
const char wwf2_serial_numbers[serial_max][serial_per]   = { "05de00333035424643163542", "05d900333035424643162544" };
// end serial number list.

// SETS SI446X PRINTF DEBUG VERBOSITY
const unsigned si4468x_debug_level = ERR99; // CHANGE ME.

// Should MAC layer be informed by SI4468 about a packet, in interrupt context or using continuations?
const bool NEED_SI4468_CONTINUATION = true;

// Pin list used in setup.
static SI446X_pin_setup_t SI446X_pin_setup;

// CORE LOCKING STUFF, MOVE ME LATER
static volatile uint32_t spi_lock;
static volatile uint32_t radio_lock;

// CMSIS includes these functions in some form
// But they didn't quite work for me and I didn't want to mod library so... --NPS
static uint32_t ___LOAD(volatile uint32_t *addr) __attribute__ ((naked));
static uint32_t ___STORE(uint32_t value, volatile uint32_t *addr) __attribute__ ((naked));

static uint32_t ___LOAD(volatile uint32_t *addr)
{
  __ASM("ldrex r0, [r0]");
  __ASM("bx lr");
}

static uint32_t ___STORE(uint32_t value, volatile uint32_t *addr)
{
  __ASM("strex r0, r0, [r1]");
  __ASM("bx lr");
}

// Returns true if lock aquired
static bool get_lock_inner(volatile uint32_t *Lock_Variable, uint32_t id) {
	int status;
	if (___LOAD(Lock_Variable) != radio_lock_none) {
		__ASM("clrex"); // TODO: AM I NEEDED?
		return false;
	}
	status = ___STORE(id, Lock_Variable);
	__DMB();

	return (status == 0);
}

// Should try more than once, can legit fail even if lock is free.
// Example, will never succeed if any interrupt hits in between.
// ldrex-strex only guarantees that lock is free when it says so, but NOT the inverse.
static uint32_t get_lock(volatile uint32_t *Lock_Variable, uint32_t id) {
	int attempts=si446x_lock_max_attempts;
	do {
		if ( get_lock_inner(Lock_Variable, id) )
			return 0;
	} while (--attempts);
	return *Lock_Variable; // return who we think the blocking owner is. NOT GUARANTEED TO BE RIGHT.
}

// TODO: Add ownership check --NPS
static void free_lock(volatile uint32_t *Lock_Variable) {
	__DMB();
	*Lock_Variable = radio_lock_none;
	return;
}

// Guarantee a lock grab. Requires IRQ mask.
// Returns previous lock owner.
// ONLY FOR USE IN VERY SPECIFIC CASES
static radio_lock_id_t si446x_radio_lock_nofail(radio_lock_id_t id) {
	radio_lock_id_t ret;
	GLOBAL_LOCK(irq);
	ret = (radio_lock_id_t) radio_lock;
	radio_lock = id;
	__DMB();
	return ret;
}

// Conditional lock set. If and only if lock owner is "cond", progress to "target".
// IRQ mask is used due to a) gives guarantee and b) cannot false-negative and c) chain-of-custody
// Returns: true if 'cond' was met.
// ONLY FOR USE IN VERY SPECIFIC CASES
static bool si446x_radio_lock_if_then_nofail(radio_lock_id_t cond, radio_lock_id_t target) {
	GLOBAL_LOCK(irq);
	if (radio_lock == cond) {
		radio_lock = target;
		__DMB();
		return true;
	} else {
		return false;
	}
}

// Returns current owner if fail, 0 if success
static radio_lock_id_t si446x_spi_lock(radio_lock_id_t id) {
	return (radio_lock_id_t) get_lock(&spi_lock, (uint32_t)id);
}

static int si446x_spi_unlock() {
	free_lock(&spi_lock);
}

// Returns current owner if fail, 0 if success
static radio_lock_id_t si446x_radio_lock(radio_lock_id_t id) {
	return (radio_lock_id_t) get_lock(&radio_lock, (uint32_t)id);
}

static int si446x_radio_unlock(void) {
	free_lock(&radio_lock);
}
// END LOCKING STUFF

// Debugging function to print lock names
// Manually sync'd with si446x.h for now
static const char* print_lock(radio_lock_id_t x) {
	switch(x) {
		case radio_lock_none: 			return "radio_lock_none";
		case radio_lock_tx: 			return "radio_lock_tx";
		case radio_lock_tx_power: 		return "radio_lock_tx_power";
		case radio_lock_set_channel:	return "radio_lock_set_channel";
		case radio_lock_cca: 			return "radio_lock_cca";
		case radio_lock_cca_ms: 		return "radio_lock_cca_ms";
		case radio_lock_rx: 			return "radio_lock_rx";
		case radio_lock_init: 			return "radio_lock_init";
		case radio_lock_uninit: 		return "radio_lock_uninit";
		case radio_lock_reset: 			return "radio_lock_reset";
		case radio_lock_sleep: 			return "radio_lock_sleep";
		case radio_lock_crc: 			return "radio_lock_crc";
		case radio_lock_interrupt: 		return "radio_lock_interrupt";
		case radio_lock_all: 			return "radio_lock_all";
		case radio_lock_rx_setup:		return "radio_lock_rx_setup";
		default: 						return "ERROR, Unknown Lock!!!";
	}
}

static const char* PrintStateID(si_state_t id){
	switch(id){
		case SI_STATE_BOOT:			return "SI_STATE_BOOT";
		case SI_STATE_SLEEP:		return "SI_STATE_SLEEP";
		case SI_STATE_SPI_ACTIVE:	return "SI_STATE_SPI_ACTIVE";
		case SI_STATE_READY:		return "SI_STATE_READY";
		case SI_STATE_READY2:		return "SI_STATE_READY2";
		case SI_STATE_TX_TUNE:		return "SI_STATE_TX_TUNE";
		case SI_STATE_RX_TUNE:		return "SI_STATE_RX_TUNE";
		case SI_STATE_TX:			return "SI_STATE_TX";
		case SI_STATE_RX:			return "SI_STATE_RX";
		case SI_STATE_ERROR:		return "SI_STATE_ERROR";
		case SI_STATE_UNKNOWN:		return "SI_STATE_UNKNOWN";
		default:					return "error";
	}
}

static void si446x_debug_print(int priority, const char *fmt, ...) {
    va_list args;
    va_start(args, fmt);

    if(priority >= si4468x_debug_level) {
		hal_vprintf(fmt, args);
	}

    va_end(args);
}

static void si446x_spi2_handle_interrupt(GPIO_PIN Pin, BOOL PinState, void* Param);

