Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	if ( owner = si446x_spi_lock(radio_lock_sleep) ) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_sleep() FAIL. SPI locked. Owner is %s\r\n", print_lock(owner));
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, TRUE );
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_sleep) ) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_sleep() FAIL. Radio Busy. Owner is %s\r\n", print_lock(owner));
		//Radio complains that tx is not yet done
		//si446x_radio_unlock();
		si446x_spi_unlock();
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, TRUE );
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		return DS_Fail;
	}

	if ( si446x_leave_rx(radio_lock_sleep) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_sleep() FAIL. Radio Busy.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_change_state(SI_STATE_SLEEP);
	si446x_radio_unlock();
	si446x_spi_unlock();

	CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
	return DS_Success;
}


DeviceStatus si446x_hal_tx_power(UINT8 radioID, int pwr) {
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power()\r\n");

	if (pwr < 0) return DS_Fail; // Not worth of a printf

	if ( owner = si446x_spi_lock(radio_lock_tx_power) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. SPI locked: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_tx_power) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. Radio locked: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_set_property( 0x22 , 1, 0x01, (uint8_t) pwr );
	tx_power = pwr;

	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}

DeviceStatus si446x_hal_set_channel(UINT8 radioID, int channel) {
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_set_channel()\r\n");
	if (channel < 0 ) return DS_Fail;

	if ( owner = si446x_spi_lock(radio_lock_set_channel) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. SPI locked: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_set_channel() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_set_channel) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. Radio Busy: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_channel = channel;

	// Technically may not need the locks.
	// But could confuse the user otherwise.
	// And still at least protects the vars.
	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}


// Doesn't belong in radio driver... --NPS
//Properties of radio
static INT8 radioType;
void si446x_hal_set_RadioType(INT8 radio)
{
	radioType = radio;
}

// Doesn't belong in radio driver...
INT8 si446x_hal_get_RadioType()
{
	return radioType;
}

// New CCA semantics after talking to Ananth + Bora
// CCA request is only valid if radio is already in RX, otherwise discard.
// Radio remains in RX after CCA. Packets that come in during CCA are discarded.
// Packets that come in atter CCA while still in RX are kept.
// NPS 2016-07-06
DeviceStatus si446x_hal_cca_ms(UINT8 radioID, UINT32 ms) {
	radio_lock_id_t owner;
	uint8_t int_enable;
	DeviceStatus ret;
	UINT64 now, now2;
	int adjusted_ms;
	const unsigned ticks_per_ms = 8000;

	now = HAL_Time_CurrentTicks();

	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca_ms() ms:%d\r\n",ms);

	SI446x_INT_MODE_CHECK();

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca_ms() FAIL. No Init.\r\n");
		return DS_Fail;
	}

	if ( owner = si446x_spi_lock(radio_lock_cca_ms) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. SPI locked: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_cca_ms) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. Radio locked: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( cont_busy() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. Continuation Pending.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	si_state_t state = si446x_request_device_state();
	if (state != SI_STATE_RX && state != SI_STATE_RX_TUNE) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() Radio not in RX. Abort CCA. State: %d\r\n", state);
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	// Allow to move from RX_TUNE to RX if needed.
	// TODO: Timeout
	while ( state == SI_STATE_RX_TUNE ) { state = si446x_request_device_state(); }

	// We don't keep/want packets for the duration of the CCA. Turn off interupts and kill FIFO afterwards.
	int_enable = si446x_get_property(0x01, 1, 0); 	// save interrupt mask
	si446x_set_property(0x01, 1, 0, 0); 			// mask all radio interrupts
	si446x_get_int_status(0xFF, 0xFF, 0xFF); 		// check interrupts final time

	// last abort chance
	if ( si446x_get_ph_pend() || si446x_get_modem_pend() ) {
		si446x_set_property(0x01, 1, 0, int_enable); 	// Unmask interrupts
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() Radio Busy.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	// We do NOT retain packets encountered during CCA.
	// Not using GLOBAL_LOCK here so YMMV with how accurate this timing is.
	now2 = HAL_Time_CurrentTicks();
	adjusted_ms = ms - ((now2-now) / ticks_per_ms) - 1;
	if(adjusted_ms > 0)
		HAL_Time_Sleep_MicroSeconds(adjusted_ms); 	// Wait specified period
	si446x_get_modem_status( 0xFF ); 				// Fetch results

	if (si446x_get_current_rssi() >= si446x_rssi_cca_thresh)
		ret = DS_Busy;
	else
		ret = DS_Success;

	si446x_leave_rx(radio_lock_cca_ms);

	si446x_get_int_status(0x0, 0x0, 0x0);	 		// Clear interrupts
	si446x_fifo_info(0x3);							// Clear FIFO
	si446x_set_property(0x01, 1, 0, int_enable);	// Unmask interrupts
	si446x_start_rx_fast_channel(si446x_channel);	// re-arm RX

