Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	si446x_radio_unlock();
	si446x_spi_unlock();
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca_ms(): CCA complete\r\n");
	return ret;
}

UINT32 si446x_hal_get_chan(UINT8 radioID) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_get_chan()\r\n");
	return si446x_channel;
}


UINT32 si446x_hal_get_power(UINT8 radioID) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_get_power()\r\n");
	return tx_power;
}

// Also possible to do this with FRR.
// Automatically saved each packet, don't need to bother radio or lock.
UINT32 si446x_hal_get_rssi(UINT8 radioID) {
	UINT32 ret = si446x_get_latched_rssi();
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_get_rssi() : %d\r\n", ret);
	return ret;
}

// INTERRUPT CONTEXT, LOCKED
static void si446x_pkt_tx_int() {
	si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_tx_int()\r\n");
	if(NEED_SI4468_CONTINUATION){
		tx_callback_continuation.Enqueue();
	}
	else{
		tx_cont_do(NULL);
	}
}

// INTERRUPT CONTEXT. LOCKED, radio_busy until we pull from continuation
static void si446x_pkt_rx_int() {
	// radio_lock owned by SYNC_DET at this point
	si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_rx_int()\r\n");
	if(NEED_SI4468_CONTINUATION){
		rx_callback_continuation.Enqueue();
		si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_rx_int()\r\n");
	}
	else{
		rx_cont_do(NULL);
	}
}

// ASSUMES SPI_LOCK IS HELD BY CALLER (INTERRUPT HANDLER)
// Interface spec is to just to drop the packet on the floor
static void si446x_pkt_bad_crc_int(void) {
	radio_lock_id_t owner 		= (radio_lock_id_t) spi_lock;
	radio_lock_id_t radio_owner = (radio_lock_id_t) radio_lock;

	ASSERT(owner == radio_lock_interrupt);
	if (owner != radio_lock_interrupt) {
		si446x_debug_print(ERR99, "SI446X: si446x_pkt_bad_crc_int() Bad spi_lock!, owner: %s\r\n", print_lock(owner));
		return;
	}

	ASSERT(radio_owner == radio_lock_rx);
	if (radio_owner != radio_lock_rx) {
		si446x_debug_print(ERR99, "SI446X: si446x_pkt_bad_crc_int() Bad radio_lock!, owner: %s\r\n", print_lock(radio_owner));
		return;
	}

	si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_bad_crc_int() Bad CRC. FIFOs cleared\r\n");
	si446x_fifo_info(0x3); 		// clear the FIFO
	// We lost the packet, so give up the radio
	si446x_radio_unlock();
}

// INTERRUPT CONTEXT
static void si446x_spi2_handle_interrupt(GPIO_PIN Pin, BOOL PinState, void* Param)
{
	uint8_t modem_pend, ph_pend;
	radio_lock_id_t owner;
	UINT64 int_ts;

	GLOBAL_LOCK(irq); // Locked due to time critical.
	int_ts = HAL_Time_CurrentTicks(); // Log RX time.
	irq.Release(); // Unlock after timestamp.

	if (Pin != SI446X_pin_setup.nirq_mf_pin) { return; }

	si446x_debug_print(DEBUG02, "SI446X: INT\r\n");

	if ( owner = si446x_spi_lock(radio_lock_interrupt) ) {
		// Damn, we got an interrupt in the middle of another transaction. Have to defer it.
		// Hope this doesn't happen much because will screw up timestamp.
		// TODO: Spend some effort to mitigate this if/when it happens.
		si446x_debug_print(ERR99, "SI446X: si446x_spi2_handle_interrupt() SPI locked: %s\r\n", print_lock(owner));
#		ifdef SI446X_DEBUG_UNFINISHED_PKT
		int_defer = true;
#		endif
		int_defer_continuation.Enqueue();
		return;
	}

	si446x_get_int_status(0x0, 0x0, 0x0); // Saves status and clears all interrupts
	ph_pend			= si446x_get_ph_pend();
	modem_pend 		= si446x_get_modem_pend();

#	ifdef SI446X_DEBUG_UNFINISHED_PKT
	int_defer = false;
#	endif

	// Only save timestamp if it was an RX event.
	// Unlock SPI after the potential radio_lock, so both don't glitch free.
	if (modem_pend & MODEM_MASK_SYNC_DETECT) {
		// Unconditional lock grab.
		owner = si446x_radio_lock_nofail(radio_lock_rx);
		if (owner != radio_lock_none && owner != radio_lock_tx)
			si446x_debug_print(ERR99, "SI446X: si446x_spi2_handle_interrupt() Odd radio_lock: %s\r\n", print_lock(owner));
		rx_timestamp = int_ts;
	}

	if (ph_pend & PH_STATUS_MASK_PACKET_RX) 	{
#		ifdef SI446X_DEBUG_UNFINISHED_PKT
		finisher_queued = true;
#		endif
		si446x_pkt_rx_int();
		ASSERT_RADIO(rx_callback_continuation.IsLinked());
	}

	if (ph_pend & PH_STATUS_MASK_PACKET_SENT) 	{ si446x_pkt_tx_int(); }
	if (ph_pend & PH_STATUS_MASK_CRC_ERROR) 	{ si446x_pkt_bad_crc_int(); }

	// If we finished a packet, go to sleep
	/*if ( (ph_pend & PH_STATUS_MASK_PACKET_RX) || (ph_pend & PH_STATUS_MASK_CRC_ERROR) ) {
		si446x_change_state(SI_STATE_SLEEP);
	}*/

	si446x_spi_unlock();
}
